tutorials-OpenFOAM-6/multiRegionReactingFoam-TransientMode/multiRegionReactingFoamTutorial/constant/bottomAir/reactions
species
(
    O2
    N2
);

reactions
{
}
